read_verilog simon.v
hierarchy -top simon
synth
write_verilog synth.v